#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.cert must be replaced
-/+ resource "aws_acm_certificate" "cert" {
      ~ arn                       = "arn:aws:acm:us-east-1:482278450468:certificate/391e4e23-fd18-41aa-9c63-b80086bcfef8" -> (known after apply)
        domain_name               = "virtualmadden.dev"
      ~ domain_validation_options = [
          - {
              - domain_name           = "virtualmadden.dev"
              - resource_record_name  = "_edfa0042b2119474786e99419ba40444.virtualmadden.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_ba47042df03e84d03c19347711ffac70.duyqrilejt.acm-validations.aws."
            },
        ] -> (known after apply)
      ~ id                        = "arn:aws:acm:us-east-1:482278450468:certificate/391e4e23-fd18-41aa-9c63-b80086bcfef8" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "www.virtualmadden.dev",
        ]
      - tags                      = {} -> null
      ~ validation_emails         = [] -> (known after apply)
        validation_method         = "DNS"

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.cert must be replaced
-/+ resource "aws_acm_certificate_validation" "cert" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:482278450468:certificate/391e4e23-fd18-41aa-9c63-b80086bcfef8" -> (known after apply) # forces replacement
      ~ id                      = "2019-12-20 23:06:32 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_edfa0042b2119474786e99419ba40444.virtualmadden.dev",
        ] -> (known after apply) # forces replacement
    }

  # aws_cloudfront_distribution.origin will be updated in-place
  ~ resource "aws_cloudfront_distribution" "origin" {
        active_trusted_signers         = {
            "enabled" = "false"
            "items.#" = "0"
        }
      ~ aliases                        = [
            "virtualmadden.dev",
          + "www.virtualmadden.dev",
        ]
        arn                            = "arn:aws:cloudfront::482278450468:distribution/E3AA50X2Z1O1DM"
        caller_reference               = "terraform-20191220230640924800000003"
        default_root_object            = "index.html"
        domain_name                    = "d1aigloyo03vqh.cloudfront.net"
        enabled                        = true
        etag                           = "E76QEH4OWD1ZU"
        hosted_zone_id                 = "Z2FDTNDATAQYW2"
        http_version                   = "http2"
        id                             = "E3AA50X2Z1O1DM"
        in_progress_validation_batches = 0
        is_ipv6_enabled                = true
        last_modified_time             = "2019-12-20 23:06:41.125 +0000 UTC"
        price_class                    = "PriceClass_All"
        retain_on_delete               = false
        status                         = "Deployed"
        tags                           = {}
        wait_for_deployment            = true

        default_cache_behavior {
            allowed_methods        = [
                "GET",
                "HEAD",
            ]
            cached_methods         = [
                "GET",
                "HEAD",
            ]
            compress               = false
            default_ttl            = 86400
            max_ttl                = 31536000
            min_ttl                = 0
            smooth_streaming       = false
            target_origin_id       = "S3-virtualmadden.dev"
            trusted_signers        = []
            viewer_protocol_policy = "redirect-to-https"

            forwarded_values {
                headers                 = []
                query_string            = false
                query_string_cache_keys = []

                cookies {
                    forward           = "none"
                    whitelisted_names = []
                }
            }
        }

        origin {
            domain_name = "virtualmadden.dev.s3.amazonaws.com"
            origin_id   = "S3-virtualmadden.dev"

            s3_origin_config {
                origin_access_identity = "origin-access-identity/cloudfront/EJB1R7IEO03DU"
            }
        }

        restrictions {
            geo_restriction {
                locations        = []
                restriction_type = "none"
            }
        }

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:482278450468:certificate/391e4e23-fd18-41aa-9c63-b80086bcfef8" -> (known after apply)
            cloudfront_default_certificate = false
            minimum_protocol_version       = "TLSv1.1_2016"
            ssl_support_method             = "sni-only"
        }
    }

  # aws_route53_record.cert_validation must be replaced
-/+ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_edfa0042b2119474786e99419ba40444.virtualmadden.dev" -> (known after apply)
      ~ id              = "Z3AF3OMMVEPJO9__edfa0042b2119474786e99419ba40444.virtualmadden.dev._CNAME" -> (known after apply)
      ~ name            = "_edfa0042b2119474786e99419ba40444.virtualmadden.dev" -> (known after apply) # forces replacement
      ~ records         = [
          - "_ba47042df03e84d03c19347711ffac70.duyqrilejt.acm-validations.aws.",
        ] -> (known after apply)
        ttl             = 60
      ~ type            = "CNAME" -> (known after apply)
        zone_id         = "Z3AF3OMMVEPJO9"
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Warning: Interpolation-only expressions are deprecated

  on acm.tf line 7, in resource "aws_acm_certificate" "cert":
   7:   domain_name               = "${var.domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 19 more similar warnings elsewhere)


Warning: Quoted references are deprecated

  on acm.tf line 11, in resource "aws_acm_certificate" "cert":
  11:   provider = "aws.certs"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Pull Request Workflow`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./infrastructure/terraform`*
